# Домашнее задание 2 (5 баллов).

Все задания ниже имеют равный вес (5/16).

In [22]:
import pandas as pd
import numpy as np

#### Описание данных

В папке Data находится информация о студентах. Всего 10 групп студентов. Файлы делятся на две категории:
    * Students_info_i - информация о студентах из группы i
    * Students_marks_i - оценки студентов из группы i за экзамены

### Одно из важных достоинств pandas $-$ это удобные методы реляционного взаимодействия с данными, аналогичные, например, возможностям SQL для слияния и конкатенации таблиц: merge, join, concat. Наличие готовых методов позволяет не реализовывать самостоятельно поэлементную обработку данных и оперировать сразу целыми таблицами данных.

Подробно об этих методах посмотрите тут: https://www.kaggle.com/residentmario/renaming-and-combining#Combining

#### Задание 1. Соберите всю информацию о студентах в одну таблицу df. В получившейся таблице должна быть информация и оценки всех студентов из всех групп. Напечатайте несколько строк таблицы для демонстрации результата.¶

In [23]:
#your code here
import glob
files = glob.glob("data\*.csv")
df = pd.DataFrame()
df2 = pd.DataFrame()
for file in files:
    if file[14] == 'i':
        data = pd.read_csv(file)
        df = pd.concat([df, data])
    else:
        data = pd.read_csv(file)
        df2 = pd.concat([df2, data])

        
df  = pd.merge(df, df2)
del df2
df[194:203]

,index,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
194,194,female,group C,master's degree,standard,completed,group2,69,84,85
195,195,male,group D,associate's degree,standard,none,group2,61,55,52
196,196,male,group C,some high school,free/reduced,completed,group2,59,69,65
197,197,male,group E,high school,free/reduced,none,group2,55,56,51
198,198,female,group B,some college,free/reduced,none,group2,45,53,55
199,199,female,group B,bachelor's degree,free/reduced,none,group2,78,79,76
200,200,female,group C,associate's degree,standard,completed,group3,67,84,86
201,201,female,group D,some college,free/reduced,none,group3,65,81,77
202,202,male,group C,associate's degree,standard,none,group3,69,77,69

#### Задание 2. Удалите столбец index у полученной таблицы. Напечатайте первые 10 строк таблицы.

In [24]:
#your code here
df = df.drop("index", axis = 1)
df.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75
5,female,group B,associate's degree,standard,none,group1,71,83,78
6,female,group B,some college,standard,completed,group1,88,95,92
7,male,group B,some college,free/reduced,none,group1,40,43,39
8,male,group D,high school,free/reduced,completed,group1,64,64,67
9,female,group B,high school,free/reduced,none,group1,38,60,50

#### Задание 3. Выведите на экран размеры полученной таблицы

In [25]:
# your code here
df.shape
# первое значение - кол-во строк, второе - кол-во столбцов

(1000, 9)

#### Задание 4. Выведите на экран статистические характеристики числовых столбцов таблицы (минимум, максимум, среднее значение, стандартное отклонение)

In [26]:
# your code here
result = df.select_dtypes(include='number') #https://tonais.ru/library/poluchenie-stolbtsov-chislovogo-tipa-dannyh-iz-dataframe-v-pandas
print('минимумы:',result.min(), 'максимумы:', result.max(),'средние значения:', result.mean(),'стандартные отклонения:',result.std(),  sep = '\n')

минимумы:
math score        0
reading score    17
writing score    10
dtype: int64
максимумы:
math score       100
reading score    100
writing score    100
dtype: int64
средние значения:
math score       66.089
reading score    69.169
writing score    68.054
dtype: float64
стандартные отклонения:
math score       15.163080
reading score    14.600192
writing score    15.195657
dtype: float64

#### Задание 5. Проверьте, есть ли в таблице пропущенные значения

In [27]:
# your code here
df.isna().any(axis=None) # https://question-it.com/questions/91753/kak-proverit-javljaetsja-li-kakoe-libo-znachenie-nan-v-pandas-dataframe#:~:text=%D0%92%D1%8B%20%D0%BC%D0%BE%D0%B6%D0%B5%D1%82%D0%B5%20%D0%BD%D0%B5%20%D1%82%D0%BE%D0%BB%D1%8C%D0%BA%D0%BE%20%D0%BF%D1%80%D0%BE%D0%B2%D0%B5%D1%80%D0%B8%D1%82%D1%8C%2C,%3D%20pd.DataFrame(%7B'col1'%3A%5B1%2C2%2C3%2C4%2C5%5D%2C%20'col2'%3A%5B6%2C%20np.nan%2C8%2C9%2C10%5D%7D)%20df
#False означает, что нет ячеек со значением NaN, True означает, что есть.

False

#### Задание 6. Выведите на экран средние баллы студентов по каждому предмету (math, reading, writing)

In [28]:
# your code here
result.mean()

math score       66.089
reading score    69.169
writing score    68.054
dtype: float64

**Задание 7. Как зависят оценки от того, проходил ли студент курс для подготовки к сдаче экзамена (test preparation course)? Выведите на экран для каждого предмета в отдельности средний балл студентов, проходивших курс для подготовки к экзамену и не проходивших курс.**

In [29]:
# your code here
print(df.groupby("test preparation course")['math score'].mean())
print(df.groupby("test preparation course")['reading score'].mean())
print(df.groupby("test preparation course")['writing score'].mean())

test preparation course
completed    69.695531
none         64.077882
Name: math score, dtype: float64
test preparation course
completed    73.893855
none         66.534268
Name: reading score, dtype: float64
test preparation course
completed    74.418994
none         64.504673
Name: writing score, dtype: float64

**Задание 8. Выведите на экран все различные значения из столбца lunch.**

In [30]:
# your code here
print(df['lunch'].unique())

['standard' 'free/reduced']

**Задание 9. Переименуйте колонку "parental level of education" в "education", а "test preparation course" в "test preparation" с помощью метода pandas rename**
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html

In [31]:
# your code here
df = df.rename (columns= {'parental level of education': 'education', 'test preparation course': 'test preparation'})
df

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,group10,88,99,95
996,male,group C,high school,free/reduced,none,group10,62,55,55
997,female,group C,high school,free/reduced,completed,group10,59,71,65
998,female,group D,some college,standard,completed,group10,68,78,77
999,female,group D,some college,free/reduced,none,group10,77,86,86

**Зафиксируем минимальный балл для сдачи экзамена**

In [32]:
passmark = 50

**Задание 10. Ответьте на вопросы:**
    * Какая доля студентов сдала экзамен по математике (passmark >= 50)?
    * Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?
    * Какая доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике?

In [33]:
# your code here
print('доля студентов, сдавших математику:',np.sum(df['math score'] >= passmark) / (np.sum(df['math score'] >= 0)))
print('доля студентов, проходивших курс подготовки к экзамену и сдавшая экзамен по математике:',np.sum((df['math score'] >= passmark) & (df['test preparation'] == 'completed')) / 
      np.sum((df['math score'] >= 0) & (df['test preparation'] == 'completed')))

print('доля женщин, не проходивших курс подготовки к экзамену, не сдавшая экзамен по математике:',np.sum((df['math score'] < passmark) & (df['test preparation'] == 'none') & (df['gender'] == 'female'))
     / np.sum((df['math score'] >= 0) & (df['test preparation'] == 'none') & (df['gender'] == 'female'))
     )

доля студентов, сдавших математику: 0.865
доля студентов, проходивших курс подготовки к экзамену и сдавшая экзамен по математике: 0.9217877094972067
доля женщин, не проходивших курс подготовки к экзамену, не сдавшая экзамен по математике: 0.20958083832335328

**Задание 11. С помощью groupby выполните задания ниже. Также выведите время выполнения каждого из заданий.**
    * Для каждой этнической группы выведите средний балл за экзамен по чтению
    * Для каждого уровня образования выведите минимальный балл за экзамен по письму

In [34]:
%%time
# your code here

print(df.groupby('race/ethnicity')['reading score'].mean(),
      df.groupby('education')['writing score'].min(),
      sep = '\n')

race/ethnicity
group A    64.674157
group B    67.352632
group C    69.103448
group D    70.030534
group E    73.028571
Name: reading score, dtype: float64
education
associate's degree    35
bachelor's degree     38
high school           15
master's degree       46
some college          19
some high school      10
Name: writing score, dtype: int64
Wall time: 3.98 ms

**Задание 12. Выполните задание 11 с помощью циклов. Сравните время выполнения.**

In [35]:
%%time
# your code here
overall_score = dict()
num_of_people = dict()
for index, row in df.iterrows():
    if row['race/ethnicity'] in overall_score:
        overall_score[row['race/ethnicity']] += row['reading score']
        num_of_people[row['race/ethnicity']] += 1
    else:
        overall_score[row['race/ethnicity']] = row['reading score']
        num_of_people[row['race/ethnicity']] = 1
for i in overall_score:
    overall_score[i] = overall_score[i] / num_of_people[i]
print(overall_score)

mins = dict()

for index, row in df.iterrows():
    if row['education'] in mins:
        if row['writing score'] <= mins[row['education']]:
            mins[row['education']] = row['writing score']
    else:
        mins[row['education']] = row['writing score']

        
print(mins)
        
# время выполнения при использовании циклов примерно в 21 раз больше

{'group B': 67.35263157894737, 'group C': 69.10344827586206, 'group A': 64.67415730337079, 'group D': 70.03053435114504, 'group E': 73.02857142857142}
{"bachelor's degree": 38, 'some college': 19, "master's degree": 46, "associate's degree": 35, 'high school': 15, 'some high school': 10}
Wall time: 86.2 ms

**Задание 13. Выведите на экран средние баллы студентов по каждому предмету в зависимости от пола и уровня образования. То есть должно получиться количество групп, равных 2 * (число уровней образования), и для каждой такой группы выыведите средний балл по каждому из предметов.**

Это можно сделать с помощью сводных таблиц (pivot_table):

https://www.kaggle.com/kamilpolak/tutorial-how-to-use-pivot-table-in-pandas

In [36]:
# your code here
df.groupby(['gender', 'education'])[['math score','reading score', 'writing score']].mean()

                           math score  reading score  writing score
gender education
female associate's degree   65.250000      74.120690      74.000000
       bachelor's degree    68.349206      77.285714      78.380952
       high school          59.351064      68.202128      66.691489
       master's degree      66.500000      76.805556      77.638889
       some college         65.406780      73.550847      74.050847
       some high school     59.296703      69.109890      68.285714
male   associate's degree   70.764151      67.433962      65.405660
       bachelor's degree    70.581818      68.090909      67.654545
       high school          64.705882      61.480392      58.539216
       master's degree      74.826087      73.130435      72.608696
       some college         69.009259      64.990741      63.148148
       some high school     67.840909      64.693182      61.375000

#### Задание 14. Сколько студентов успешно сдали экзамен по математике?

Создайте новый столбец в таблице df под названием Math_PassStatus и запишите в него F, если студент не сдал экзамен по математике (балл за экзамен < passmark), и P иначе.

Посчитайте количество студентов, сдавших и не сдавших экзамен по математике.

Сделайте аналогичные шаги для экзаменов по чтению и письму.

In [37]:
# your code here

df['Math_PassStatus'] = df['math score'].apply(lambda i: "F" if i < passmark else 'P')
print('Cдали математику: ',np.sum(df['Math_PassStatus'] == 'P'),
      ', не сдали математику: ',np.sum(df['Math_PassStatus'] == 'F'), sep = '')
df['Reading_PassStatus'] = df['reading score'].apply(lambda i: "F" if i < passmark else 'P')
print('Cдали чтение: ',np.sum(df['Reading_PassStatus'] == 'P'),
      ', не сдали чтение: ',np.sum(df['Reading_PassStatus'] == 'F'), sep = '')
df['Writing_PassStatus'] = df['writing score'].apply(lambda i: "F" if i < passmark else 'P')
print('Cдали письменный экзамен: ',np.sum(df['Writing_PassStatus'] == 'P'),
      ', не сдали письменный экзамен: ',np.sum(df['Writing_PassStatus'] == 'F'), sep = '')

Cдали математику: 865, не сдали математику: 135
Cдали чтение: 910, не сдали чтение: 90
Cдали письменный экзамен: 886, не сдали письменный экзамен: 114

#### Задание 15. Сколько студентов успешно сдали все экзамены?

Создайте столбец OverAll_PassStatus и запишите в него для каждого студента 'F', если студент не сдал хотя бы один из трех экзаменов, а иначе 'P'.

Посчитайте количество студентов, которые сдали все экзамены.

In [38]:
# your code here

df["OverAll_PassStatus"] = ((df.Writing_PassStatus == "P")
                            & (df.Reading_PassStatus == "P") & (df.Math_PassStatus == "P"))

df["OverAll_PassStatus"] = df["OverAll_PassStatus"].apply(lambda i: "P" if i == True else "F")

print (np.sum(df["OverAll_PassStatus"] == "P"),'студента сдали все экзамены')

812 студента сдали все экзамены

#### Задание 16. Переведем баллы в оценки

### Система перевода баллов в оценки
####    больше 90 = A
####      80-90 = B
####      70-80 = C
####      60-70 = D
####      50-60 = E
####    меньше 50 = F (Fail)

Создайте вспомогательную функцию, которая будет по среднему баллу за три экзамена выставлять оценку студенту по данным выше критериям.

Создайте столбец Grade и запишите в него оценку каждого студента.

Выведите количество студентов, получивших каждую из оценок.

**В случае, если средний балл попадает на границу между оценками (т.е. равен ровно 60, 70 или 80 баллов), вы можете интерпретировать условие на своё усмотрение (т.е. можете поставить за 60 баллов оценку D, а можете - E).**

In [39]:
def GetGrade(average_mark):
    if average_mark < 50: 
        return 'F'
    if (average_mark >= 50) & (average_mark < 60) : 
        return 'E'
    if (average_mark >= 60) & (average_mark < 70) : 
        return 'D'
    if (average_mark >= 70) & (average_mark < 80) : 
        return 'C'
    if (average_mark >= 80) & (average_mark < 90) : 
        return 'B'
    if (average_mark >= 90)  : 
        return 'A'
df['Grade'] = df[['math score','reading score', 'writing score']].mean(axis = 1).apply(GetGrade)
df.groupby('Grade')['Grade'].count()

Grade
A     52
B    146
C    261
D    256
E    182
F    103
Name: Grade, dtype: int64